---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.HighlightedElementDisconnected
source: html/de010e28-e38e-510d-ede2-f8767456c2e8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.HighlightedElementDisconnected Property

The highlighted element has been disconnected.

## Syntax (C#)
```csharp
public static FailureDefinitionId HighlightedElementDisconnected { get; }
```